tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationApp.cpp
#include "IrrigationApp.h"

#include <Arduino.h>
#include <Esp32Base.h>
#include <Wire.h>

#include <climits>
#include <cstring>

#include "BoardHardware.h"
#include "BoardPins.h"
#include "IrrigationIot.h"
#include "IrrigationRecordStream.h"
#include "IrrigationWeb.h"

namespace {

constexpr const char* kFirmwareName = "esp32-irrigation";
constexpr const char* kFirmwareVersion = "0.8.0";
constexpr const char* kDefaultWebUser = "admin";
constexpr const char* kDefaultWebPassword = "admin";

struct LatestTrustedEpoch {
    uint32_t value = 0;
};

void collectWateringEpoch(const StoredWateringRecord& record, void* user) {
    auto* latest = static_cast<LatestTrustedEpoch*>(user);
    uint32_t epoch = 0;
    if (latest && Esp32BaseRecordStore::resolveCompletedEpoch(record.timing, epoch) &&
        epoch > latest->value) {
        latest->value = epoch;
    }
}

void collectEventEpoch(const Esp32BaseAppEvents::EventRecord& event, void* user) {
    auto* latest = static_cast<LatestTrustedEpoch*>(user);
    uint32_t epoch = 0;
    if (latest && Esp32BaseRecordStore::resolveCompletedEpoch(event.timing, epoch) &&
        epoch > latest->value) {
        latest->value = epoch;
    }
}

bool failStartup(BoardHardware& hardware, StatusIndicator& indicator) {
    hardware.safeShutdown();
    const uint32_t nowMs = millis();
    indicator.setMode(StatusIndicator::Mode::Critical, nowMs);
    indicator.handle(nowMs);
    return false;
}

}  // namespace

IrrigationApp::IrrigationApp()
    : wateringController_(BoardHardware::instance()),
      statusIndicator_(StatusIndicator::instance()) {}

IrrigationApp& IrrigationApp::instance() {
    static IrrigationApp app;
    return app;
}

bool IrrigationApp::begin() {
    if (started_) {
        return baseReady_;
    }
    started_ = true;

    // This must remain the first hardware operation of application startup.
    BoardHardware& hardware = BoardHardware::instance();
    const bool hardwareReady = hardware.begin(20000);
    statusIndicator_.begin(millis());

    Serial.begin(115200);
    if (!hardwareReady) {
        return failStartup(hardware, statusIndicator_);
    }

    Wire.begin(BoardPins::kI2cSdaPin, BoardPins::kI2cSclPin);
    Esp32Base::setFirmwareInfo(kFirmwareName, kFirmwareVersion);
    Esp32BaseRtc::configure(Wire);
    if (!IrrigationIot::instance().configure()) {
        return failStartup(hardware, statusIndicator_);
    }
    Esp32BaseWeb::setDefaultAuth(kDefaultWebUser, kDefaultWebPassword);
    Esp32BaseWeb::setAfterFormatFsCallback(afterFormatFs, this);
    if (!IrrigationParameterConfig::registerFields(parameterConfigSaved,
                                                   validateParameterConfig,
                                                   this) ||
        !IrrigationWeb::registerRoutes(*this)) {
        return failStartup(hardware, statusIndicator_);
    }
    baseReady_ = Esp32Base::begin();
    if (!baseReady_) {
        return failStartup(hardware, statusIndicator_);
    }
    Esp32BaseWiFi::setPowerSave(true);
    if (!configStore_.begin()) {
        return failStartup(hardware, statusIndicator_);
    }

    if (!applyStoredParameterConfig()) {
        return failStartup(hardware, statusIndicator_);
    }

    const IrrigationConfig* config = configStore_.current();
    if (!config ||
        (config->valveDrive.pwmFrequencyHz != 20000U &&
         !hardware.configureValvePwmFrequency(config->valveDrive.pwmFrequencyHz))) {
        return failStartup(hardware, statusIndicator_);
    }

    const bool storeReady = wateringRecordStore_.begin();
    const bool storeRegistered =
        Esp32BaseWeb::registerBusinessRecordStore(wateringRecordStore_.baseStore());
    wateringRecordStoreRegistered_ = storeRegistered;
    recordStorageFault_ = !storeReady || !storeRegistered ||
                          wateringRecordStore_.state() !=
                              Esp32BaseRecordStore::StoreState::Ready;
    if (!storeReady) {
        ESP32BASE_LOG_E("irrigation",
                        "watering_record_store_begin_failed state=%s error=%s",
                        Esp32BaseRecordStore::storeStateName(wateringRecordStore_.state()),
                        wateringRecordStore_.lastErrorReason());
    }
    if (!storeRegistered) {
        ESP32BASE_LOG_E("irrigation", "watering_record_store_registration_failed");
    }
    if (storeReady) {
        Esp32BaseRecordStore::StoreStatus status;
        wateringRecordStore_.readStatus(status);
        ESP32BASE_LOG_I("irrigation",
                        "watering_record_store_ready state=%s records=%lu capacity=%lu slot_bytes=%lu max_bytes=%lu",
                        Esp32BaseRecordStore::storeStateName(status.state),
                        static_cast<unsigned long>(status.recordCount),
                        static_cast<unsigned long>(status.capacity),
                        static_cast<unsigned long>(status.slotSizeBytes),
                        static_cast<unsigned long>(status.maximumStoreBytes));
    }
    IrrigationIot::instance().begin();
    if (!IrrigationRecordStream::instance().ready()) {
        recordStorageFault_ = true;
    }

    schedulerStorageFault_ = !wateringScheduler_.begin(wateringSchedulerStore_);
    wateringScheduler_.setCallbacks(startScheduledWatering, handleSchedulerEvent, this);
    if (schedulerStorageFault_) {
        ESP32BASE_LOG_E("irrigation", "watering_scheduler_store_unavailable");
    }
    aliveCheckpoint_.begin();
    LatestTrustedEpoch latestTrusted;
    latestTrusted.value = aliveCheckpoint_.lastKnownAliveEpoch();
    wateringRecordStore_.readLatest(0, 1, collectWateringEpoch, &latestTrusted);
    Esp32BaseAppEvents::readLatest(0, 1, collectEventEpoch, &latestTrusted);
    wateringScheduler_.setTrustedEpochBaseline(latestTrusted.value);

    businessReady_ = true;
    const uint32_t readyMs = millis();
    resetUnexpectedFlowMonitor(readyMs);
    updateStatusIndicator(readyMs);
    ESP32BASE_LOG_I("irrigation", "business_ready records_fault=%s events_fault=%s scheduler_fault=%s",
                    recordStorageFault_ ? "yes" : "no",
                    Esp32BaseAppEvents::isEventStoreReady() ? "no" : "yes",
                    schedulerStorageFault_ ? "yes" : "no");
    return true;
}

void IrrigationApp::handle() {
    const uint32_t nowMs = millis();
    if (!started_ || !baseReady_) {
        BoardHardware::instance().safeShutdown();
        statusIndicator_.setMode(StatusIndicator::Mode::Critical, nowMs);
        statusIndicator_.handle(nowMs);
        return;
    }

    advanceBusiness();
    IrrigationIot::instance().handle(*this);
    updateStatusIndicator(nowMs);
    Esp32Base::handle();
}

bool IrrigationApp::baseReady() const {
    return baseReady_;
}

bool IrrigationApp::businessReady() const {
    return businessReady_;
}

WateringStartResult IrrigationApp::startWatering(const WateringRequest& request) {
    if (!businessReady_) {
        return WateringStartResult::NotReady;
    }
    if (wateringController_.status().active) {
        return WateringStartResult::Busy;
    }
    if (wateringController_.finishedSession()) {
        return WateringStartResult::PreviousResultPending;
    }
    const IrrigationConfig* config = configStore_.current();
    if (!config) {
        return WateringStartResult::NotReady;
    }

