tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationApp.cpp
    Esp32BaseRecordStore::RecordStartTime startTime;
    const bool captured = wateringRecordStore_.captureStartTime(startTime);
    const WateringStartResult result = wateringController_.start(request, *config, millis());
    if (result == WateringStartResult::Started) {
        wateringStartTime_ = startTime;
        wateringStartTimeValid_ = captured;
        pendingLowFlowEvents_ = {};
        pendingHighFlowEvents_ = {};
    }
    return result;
}

WateringStartResult IrrigationApp::startManualWatering(
    const std::array<uint16_t, BoardPins::kZoneCount>& zoneDurationMinutes) {
    const IrrigationConfig* config = configStore_.current();
    if (!config) {
        return WateringStartResult::NotReady;
    }
    WateringRequest request{};
    request.source = WateringSource::ManualZones;
    request.purpose = WateringPurpose::Normal;
    for (uint8_t index = 0; index < config->zones.size(); ++index) {
        if (zoneDurationMinutes[index] == 0) {
            continue;
        }
        if (!config->zones[index].enabled ||
            zoneDurationMinutes[index] > config->runLimits.maximumZoneDurationMinutes) {
            return WateringStartResult::InvalidRequest;
        }
        request.steps[request.stepCount++] = {
            config->zones[index].id,
            static_cast<uint32_t>(zoneDurationMinutes[index]) * 60U,
        };
    }
    return startWatering(request);
}

WateringStartResult IrrigationApp::startSingleOutput(uint8_t zoneId,
                                                     uint32_t targetDurationSec,
                                                     uint32_t targetWaterMl) {
    const IrrigationConfig* config = configStore_.current();
    const uint32_t maximumDurationSec = config
        ? static_cast<uint32_t>(config->runLimits.maximumZoneDurationMinutes) * 60U
        : 0U;
    const uint32_t maximumWaterMl = config
        ? static_cast<uint32_t>(config->runLimits.maximumSingleOutputLiters) * 1000U
        : 0U;
    if (!config || !BoardPins::isValidZoneId(zoneId) ||
        !config->zones[BoardPins::zoneIndex(zoneId)].enabled ||
        targetDurationSec == 0 || targetDurationSec > maximumDurationSec ||
        (targetWaterMl != 0 &&
         (targetWaterMl < 100U || targetWaterMl > maximumWaterMl))) {
        return WateringStartResult::InvalidRequest;
    }
    WateringRequest request{};
    request.source = WateringSource::SingleOutput;
    request.purpose = WateringPurpose::Normal;
    request.stepCount = 1;
    request.steps[0] = {zoneId, targetDurationSec, targetWaterMl};
    return startWatering(request);
}

bool IrrigationApp::stopWatering() {
    return businessReady_ && wateringController_.stop(millis());
}

WateringStatus IrrigationApp::wateringStatus() const {
    return wateringController_.status();
}

FlowHistorySnapshot IrrigationApp::wateringFlowHistory() const {
    return wateringController_.flowHistory();
}

bool IrrigationApp::readLatestWateringRecords(uint32_t offset,
                                              uint32_t limit,
                                              WateringRecordStore::ReadCallback callback,
                                              void* user) {
    return wateringRecordStore_.readLatest(offset, limit, callback, user);
}

Esp32BaseRecordStore::RecordReadResult IrrigationApp::readWateringRecordById(
    uint32_t recordId,
    StoredWateringRecord& record) {
    return wateringRecordStore_.readById(recordId, record);
}

bool IrrigationApp::readWateringRecordStoreStatus(
    Esp32BaseRecordStore::StoreStatus& status) const {
    return wateringRecordStore_.readStatus(status);
}

bool IrrigationApp::readLatestEvents(uint32_t offset,
                                     uint32_t limit,
                                     IrrigationEvents::ReadCallback callback,
                                     void* user) const {
    return events_.readLatest(offset, limit, callback, user);
}

bool IrrigationApp::readEventStatus(Esp32BaseAppEvents::AppEventsStatus& status) const {
    return events_.readStatus(status);
}

IrrigationEvents::ConditionDisplayState IrrigationApp::eventConditionState(
    uint8_t conditionId) const {
    return events_.conditionState(conditionId);
}

bool IrrigationApp::recordStorageFault() const {
    return recordStorageFault_ ||
           !IrrigationRecordStream::instance().writable();
}

bool IrrigationApp::eventStorageFault() const {
    return events_.storageFault();
}

bool IrrigationApp::schedulerStorageFault() const {
    return schedulerStorageFault_;
}

bool IrrigationApp::checkpointStorageFault() const {
    return aliveCheckpoint_.storageFault();
}

uint32_t IrrigationApp::lastKnownAliveEpoch() const {
    return aliveCheckpoint_.lastKnownAliveEpoch();
}

bool IrrigationApp::unexpectedFlowAlarm() const {
    return unexpectedFlowMonitor_.alarmActive();
}

bool IrrigationApp::unexpectedFlowObservationReady() const {
    return unexpectedFlowMonitor_.observationReady(millis());
}

uint16_t IrrigationApp::unexpectedFlowDelayRemainingSec() const {
    return unexpectedFlowMonitor_.delayRemainingSec(millis());
}

uint16_t IrrigationApp::unexpectedFlowWindowRemainingSec() const {
    return unexpectedFlowMonitor_.windowRemainingSec(millis());
}

uint16_t IrrigationApp::unexpectedFlowObservedWindowSec() const {
    const uint32_t durationMs =
        unexpectedFlowMonitor_.observedDurationMs(millis());
    return durationMs == 0
               ? 0
               : static_cast<uint16_t>((durationMs + 999U) / 1000U);
}

uint32_t IrrigationApp::unexpectedFlowObservedPulseCount() const {
    return unexpectedFlowMonitor_.observedPulseCount();
}

uint32_t IrrigationApp::unexpectedFlowEstimatedMlPerMinute() const {
    const IrrigationConfig* config = configStore_.current();
    const uint32_t durationMs =
        unexpectedFlowMonitor_.observedDurationMs(millis());
    const uint32_t pulseCount = unexpectedFlowMonitor_.observedPulseCount();
    if (!config || durationMs == 0 || pulseCount == 0) return 0;
    const uint64_t rate =
        (static_cast<uint64_t>(pulseCount) * 100000ULL +
         durationMs / 2U) /
        durationMs;
    uint32_t flowMlPerMinute = 0;
    FlowMonitor::pulseRateToFlowMlPerMinute(
        rate > UINT32_MAX ? UINT32_MAX : static_cast<uint32_t>(rate),
        config->flowMeter.pulsesPerLiterX100,
        flowMlPerMinute);
    return flowMlPerMinute;
}

AutomaticWateringState IrrigationApp::automaticWateringState() const {
    return wateringScheduler_.automaticState();
}

NextAutomaticWatering IrrigationApp::nextAutomaticWatering() const {
    const IrrigationConfig* config = configStore_.current();
    if (!config) {
        return {NextAutomaticWateringStatus::TimeUnavailable, 0, 0};
    }
    return wateringScheduler_.nextAutomaticWatering(
        *config, Esp32BaseTime::snapshot().epochSec);
}

